// 基本数据类型
package main

func main() {
	/*
		基本数据类型:
			1.布尔类型
				false true
			2.数值类型
				整形 int
					有符号int
						int8	有符号 8位整型 (-128 到 127)
						int16	有符号 16位整型 (-32768 到 32767)
						int32	有符号 32位整型 (-2147483648 到 2147483647)
						int64	有符号 64位整型 (-9223372036854775808 到 9223372036854775807)
					无符号uint
						uint8	无符号 8位整型 (0 到 255)
						uint16	无符号 16位整型 (0 到 65535)
						uint32	无符号 32位整型 (0 到 4294967295)
						uint64	无符号 64位整型 (0 到 18446744073709551615)
				浮点型
					Go语言支持两种浮点型数：float32和float64。这两种浮点型数据格式遵循IEEE 754标准
			3.字符串类型
			4.复合类型
				array,slice,map,function,pointer,struct,interface,channel,.
	*/
}
