package main

import "fmt"

func main() {
	//多重for循环

	/* 1. 打印：
	      	*****
			*****
			*****
			*****
			*****

	*/
	//第一行
	//for i := 1; i <= 5; i++ {
	//	fmt.Print("*")
	//}
	//fmt.Println()
	////第二行
	//for i := 1; i <= 5; i++ {
	//	fmt.Print("*")
	//}
	//fmt.Println()
	//第三行
	//..
	// 打印5行
	for j := 0; j < 5; j++ {
		for i := 1; i <= 5; i++ {
			fmt.Print("*")
		}
		fmt.Println()
	}
	fmt.Println("---------------------------------")
	/*
		1×1=1                 //第一行 m 1 n1
		1×2=2 2×2=4 		  //第二行 m 12 n2
		1×3=3 2×3=6 3×3=9     //第三行 m123 n3
		1×4=4 2×4=8 3×4=12 4×4=16
		1×5=5 2×5=10 3×5=15 4×5=20 5×5=25
		1×6=6 2×6=12 3×6=18 4×6=24 5×6=30 6×6=36
		1×7=7 2×7=14 3×7=21 4×7=28 5×7=35 6×7=42 7×7=49
		1×8=8 2×8=16 3×8=24 4×8=32 5×8=40 6×8=48 7×8=56 8×8=64
		1×9=9 2×9=18 3×9=27 4×9=36 5×9=45 6×9=54 7×9=63 8×9=72 9×9=81

	*/
	// 第一行 1x1=1 m*n=..
	//fmt.Printf("%dx%d=%d\n", 1, 1, 1)
	//
	//// 第二行 1x2 2x2
	//for m := 1; m <= 2; m++ {
	//	fmt.Printf("%dx%d=%d\t", m, 2, m*2)
	//}
	//fmt.Println()
	//// 第三行 1×3=3 2×3=6 3×3=9
	//for n := 1; n <= 3; n++ {
	//	fmt.Printf("%dx%d=%d\t", n, 3, n*3)
	//}

	for n := 1; n < 10; n++ {
		for m := 1; m <= n; m++ {
			fmt.Printf("%d x %d = %d\t", m, n, n*m)
		}
		fmt.Println()
	}
}
