// 数据类型  整形  int有符号的整数 uint 无符号整数
//uint8	无符号 8位整型 (0 到 255)
//uint16	无符号 16位整型 (0 到 65535)
//uint32	无符号 32位整型 (0 到 4294967295)
//uint64	无符号 64位整型 (0 到 18446744073709551615)
//int8	有符号 8位整型 (-128 到 127)
//int16	有符号 16位整型 (-32768 到 32767)
//int32	有符号 32位整型 (-2147483648 到 2147483647)
//int64	有符号 64位整型 (-9223372036854775808 到 9223372036854775807)

package main

import "fmt"

func main() {
	// 十进制
	var a int = 10
	fmt.Printf("%d\n", a) //%d 八进制的整数
	fmt.Printf("%b\n", a) //%b 二进制 00001010

	// 八进制
	var b int = 077
	fmt.Printf("%o\n", b) //%o 八进制

	// 十六进制
	var c int = 0xff
	fmt.Printf("%x\n", c) //%x 十六进制
}
